app/controllers/tax_bill_controller.rb

  def get_taxes
    if params[:name].present? && params[:tax_code].present? && params[:price].present?
      new_item = Item.save_item(params)
---
INSERT INTO "items" ("name", "tax_code", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "abcdef"], ["tax_code", 3000], ["price", 3000], ["created_at", "2019-05-11 12:45:39.549291"], ["updated_at", "2019-05-11 12:45:39.549291"]]

  def calculate
    result = []
    Item.all.each do |item|
---
SELECT "items".* FROM "items"