app/controllers/tax_bill_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-05-12 16:42:47.891206"], ["updated_at", "2019-05-12 16:42:47.891206"]]
SELECT "users"."id" FROM "users"
INSERT INTO "items" ("tax_type_id", "user_id", "name", "tax_code", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["tax_type_id", 1], ["user_id", 1], ["name", "aaaa"], ["tax_code", 1], ["price", 1000], ["created_at", "2019-05-12 17:00:04.426517"], ["updated_at", "2019-05-12 17:00:04.426517"]]
SELECT "items".* FROM "items"
---
  def save_item
    if params[:userid].present? && params[:name].present? && params[:tax_code].present? && params[:price].present?
      User.create unless User.ids.include? params[:userid].to_i
      new_item = Item.save_item(params)
    end
    render :json => { status: new_item.present? }

SELECT "users"."id" FROM "users"
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 1]]
SELECT  "tax_types".* FROM "tax_types" WHERE "tax_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tax_types".* FROM "tax_types" WHERE "tax_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "tax_types".* FROM "tax_types" WHERE "tax_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def get_bills
    if params[:userid].present? && User.ids.include?(params[:userid].to_i)
      result = []
      total = { "price_subtotal" => 0, "tax_subtotal" => 0, "grand_total" => 0 }
      Item.all.where(user_id: params[:userid].to_i).each do |item|
        temp_item = {}
        if item.tax_code == 1
          temp_item = TaxType.find(1).as_json
          temp_item["tax_code"] = 1
          temp_item["name"] = item.name
          temp_item["price"] = item.price
          temp_item["tax"] = 0.1*item.price
          temp_item["amount"] = temp_item["tax"] + item.price
        elsif item.tax_code == 2
          temp_item = TaxType.find(2).as_json
          temp_item["tax_code"] = 2
          temp_item["name"] = item.name
          temp_item["price"] = item.price
          temp_item["tax"] = (0.02*item.price) + 10
          temp_item["amount"] = temp_item["tax"] + item.price
        elsif item.tax_code == 3
          temp_item = TaxType.find(3).as_json