app/models/item.rb

INSERT INTO "items" ("tax_type_id", "user_id", "name", "tax_code", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["tax_type_id", 1], ["user_id", 1], ["name", "aaaa"], ["tax_code", 1], ["price", 1000], ["created_at", "2019-05-12 17:00:04.426517"], ["updated_at", "2019-05-12 17:00:04.426517"]]
INSERT INTO "items" ("name", "tax_code", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "abcdef"], ["tax_code", 3000], ["price", 3000], ["created_at", "2019-05-11 12:45:39.549291"], ["updated_at", "2019-05-11 12:45:39.549291"]]
---
  def self.save_item(item)
    if TAX_CODES.keys.include? item[:tax_code].to_i
      new_item = Item.create(
        name: item[:name],
        tax_code: item[:tax_code],
        price: item[:price]
      )